#### [infrastructure/aws/dev] Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```

terraform
data.aws_caller_identity.current: Reading...
module.lambda_function.aws_lambda_layer_version.my_layer: Refreshing state... [id=arn:aws:lambda:us-east-1:365270812784:layer:lambda-requests-s3-requirements:8]
module.role_lambda.aws_iam_role.my_role: Refreshing state... [id=lambda-requests-s3-lambda-role-dev]
module.my_api_gateway.aws_api_gateway_rest_api.my_api_gateway: Refreshing state... [id=s6e8hbg6he]
module.my_api_gateway.aws_api_gateway_api_key.api_key: Refreshing state... [id=k9lolvajld]
module.my_bucket.aws_s3_bucket.my_bucket: Refreshing state... [id=lambda-requests-s3-dev]
data.aws_caller_identity.current: Read complete after 1s [id=365270812784]
module.my_api_gateway.aws_api_gateway_deployment.my_deployment: Refreshing state... [id=xh8p31]
module.my_api_gateway.aws_api_gateway_resource.my_api_gateway_resource: Refreshing state... [id=ifzl6e]
module.my_api_gateway.aws_api_gateway_usage_plan.usage_plan: Refreshing state... [id=yz73zv]
module.my_api_gateway.aws_api_gateway_method.my_api_gateway_method: Refreshing state... [id=agm-s6e8hbg6he-ifzl6e-ANY]
module.my_api_gateway.aws_api_gateway_usage_plan_key.api_key_attachment: Refreshing state... [id=k9lolvajld]
module.role_lambda.aws_iam_policy.my_policy: Refreshing state... [id=arn:aws:iam::365270812784:policy/lambda-requests-s3-lambda-policy-dev]
module.my_bucket.aws_s3_bucket_versioning.versioning_example: Refreshing state... [id=lambda-requests-s3-dev]
module.lambda_function.aws_lambda_function.my_lambda: Refreshing state... [id=lambda-requests-s3-fn-dev]
module.my_bucket.aws_s3_bucket_server_side_encryption_configuration.example: Refreshing state... [id=lambda-requests-s3-dev]
module.role_lambda.aws_iam_role_policy_attachment.iam-policy-attach: Refreshing state... [id=lambda-requests-s3-lambda-role-dev-20230805233220868200000001]
module.my_api_gateway.aws_api_gateway_integration.my_lambda_integration: Refreshing state... [id=agi-s6e8hbg6he-ifzl6e-ANY]
module.lambda_function.aws_lambda_permission.lambda_permision: Refreshing state... [id=AllowAPIGatewayInvoke]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.my_lambda will be updated in-place
  ~ resource "aws_lambda_function" "my_lambda" {
        id                             = "lambda-requests-s3-fn-dev"
      ~ last_modified                  = "2023-08-20T22:55:09.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-east-1:365270812784:layer:lambda-requests-s3-requirements:8",
        ] -> (known after apply)
      ~ source_code_hash               = "D2DMeG+hbtHBxkLSjPECyuPiiZStzWsG+67Ne3oOtUs=" -> "TAzFkAAtFVdF+MxiVB/USfjfXkljXCD0bf2m7tRvqjw="
        tags                           = {}
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_layer_version.my_layer must be replaced
-/+ resource "aws_lambda_layer_version" "my_layer" {
      ~ arn                         = "arn:aws:lambda:us-east-1:365270812784:layer:lambda-requests-s3-requirements:8" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-08-20T22:54:57.204+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:us-east-1:365270812784:layer:lambda-requests-s3-requirements:8" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:us-east-1:365270812784:layer:lambda-requests-s3-requirements" -> (known after apply)
      ~ layer_name                  = "lambda-requests-s3-requirements" -> "lambda-requests-s3-requirements-dev" # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "YYdoGiyCdetrNRJm+evfhJJ0NdPeaNylyK8bUNukGaU=" -> "WZdcEqkywEw256iHsBbDgUPpbI8hDq2CJSOOUcVXdFw=" # forces replacement
      ~ source_code_size            = 976939 -> (known after apply)
      ~ version                     = "8" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @madinya, Action: `pull_request`*